ascii_art=' ▄██████▄   ██    ██  ████████████    ▄████████    ▄████████    ▄█    █▄    ▄██   ▄
███    ███  ██    ██  ██    ██   ██   ███    ███   ███    ███   ███    ███   ███   ██▄
███    ███  ██▀▀▀▀██  ██    ██   ██   ███    ███   ███    █▀    ███    ███   ███▄▄▄███
███    ███  ██    ██  ████████████   ███    ███  ▄███▄▄▄▄██▀  ▄███▄▄▄▄███▄▄ ▀▀▀▀▀▀███
███    ███  ██▀▀▀▀██  ██    ██   ██ ▀███████████ ▀▀███▀▀▀▀▀   ▀▀███▀▀▀▀███▀  ▄██   ███
███    ███  ██    ██  ██    ██   ██   ███    ███ ▀███████████   ███    ███   ███   ███
███    ███  ██    ██  ██    ██   ██   ███    ███   ███    ███   ███    ███   ███   ███
 ▀██████▀   ██    ██  ██    ██   ██   ███    █▀    ███    ███   ███    █▀     ▀█████▀
                                                  ███    ███                         '

echo -e "\n$ascii_art\n"

pacman -Q git &>/dev/null || sudo pacman -Sy --noconfirm --needed git

echo -e "\nCloning OhmArchy..."
rm -rf ~/.local/share/omarchy/
git clone https://github.com/CyphrRiot/OhmArchy.git ~/.local/share/omarchy >/dev/null

# Use custom branch if instructed
if [[ -n "$OMARCHY_REF" ]]; then
  echo -e "\eUsing branch: $OMARCHY_REF"
  cd ~/.local/share/omarchy
  git fetch origin "${OMARCHY_REF}" && git checkout "${OMARCHY_REF}"
  cd -
fi

echo -e "\nOhmArchy installation starting..."
source ~/.local/share/omarchy/install.sh
